//საკლასო დავალება:
//შექმენით ფუნქცია სახელად discountFunc. ამ ფუნქციას პარამეტრი არ სჭირდება. ფუნქციაში მომხმარებელს შემოატანინეთ ასაკი. 
//თუ ასაკი ნაკლებია 18-ზე, დაუბეჭდეთ 20%, თუ ასაკი მეტია ან ტოლია 18-ზე და ნაკლებია 65-ზე, დაუბეჭდეთ 5%, ხოლო
//ყველა სხვა დანარჩენ შემთხვევაში დაუბეჭდეთ 10%.
//ფუნქცია გამოიძახეთ მაშინ, როდესაც ვებსაიტზე მომხმარებელი დააკლიკებს ღილაკს
function discountFunc() {
    let age = Number(prompt("Enter Your Age:  "))
    if (age < 18){
        console.log("20%")
    } else if(age < 65){
        console.log("5%")
    } else {
        console.log("10%")
    }


}