#Debugging
#გამართვა, კომპიუტერულ პროგრამირებასა და ინჟინერიაში, არის მრავალსაფეხურიანი პროცესი, რომელიც მოიცავს პრობლემის იდენტიფიცირებას, პრობლემის წყაროს იზოლირებას და შემდეგ პრობლემის გამოსწორებას ან მის გარშემო მუშაობის გზის განსაზღვრას. გამართვის საბოლოო ნაბიჯი არის შესწორების ან გამოსავლის ტესტირება და დარწმუნდით, რომ ის მუშაობს.

#პროგრამული უზრუნველყოფის შემუშავებისას, გამართვის პროცესი იწყება მაშინ, როდესაც დეველოპერი აღმოაჩენს კოდის შეცდომას კომპიუტერულ პროგრამაში და შეუძლია მისი რეპროდუცირება. გამართვა პროგრამული უზრუნველყოფის ტესტირების პროცესის ნაწილია და პროგრამული უზრუნველყოფის განვითარების მთელი ცხოვრების ციკლის განუყოფელი ნაწილია.

#ტექნიკის შემუშავებისას, გამართვის პროცესი ეძებს ტექნიკის კომპონენტებს, რომლებიც არ არის დაინსტალირებული ან არასწორად კონფიგურირებული
age = 14
age = 15
age = 16
age = 17
age = 18
print(age)
