print(3+3)
print(2536421+6677426624)
print(12+44)

print(8-3)
print(8-11)
print(9-2)

print(10/5)
print(20/10)
print(10000000/10000)

print(8*8)
print(9*111)
print(12093*123433)

print(10%11)
print(17%13)
print(1333%647)

print(8**12)
print(9**45)
print(12**33)


#გაყოფა ნაშთიან გაყოფასთან შედარებით სულ სხვანაირია ვინაიდან ნაშთიანი გაყოფა არ ყოფს კონკრეტულ მითითებულ ციფრებს ის ითვლის ამ ციფრების ნაშთს ხოლო მეორე მხარეს გაყოფა პირდაპირვე ყოფს მითითებულ რიცხვს და ამას ტერმინალზე წერს

x=40
y=43
print(x)
print(y)
x=60
y=63
print(x)
print(y)


