#საკლასო დავალება: მომხმარებელს შემოატანინეთ 2 რიცხვი, num1, num2.

#თუ პირველი მეტია მეორეზე, შექმენით დიაპაზონი მეორე რიცხვიდან პირველი რიცხვის ჩათვლით და დაბეჭდეთ მხოლოდ ლუწი.

#ხოლო თუ მეორე რიცხვი მეტია პირველზე, შექმენით დიაპაზონი პირველიდან მეორეს ჩათვლით და დაბეჭდეთ მხოლოდ კენტი რიცხვები.

#საბოლოოდ დაბეჭდეთ ყველა ამ დაბეჭდილი რიცხვის ჯამი.

num1 = int(input("Enter Number:  "))
num2 = int(input("Enter Number:  "))
for i in range(num2, num1,2):
    print(i)
for x in range(num1, num2,3):
    print(x)


